app/controllers/home_controller.rb

INSERT INTO "properties" ("street", "city", "state", "zip", "latitude", "longitude", "zestimate", "thirty_day_change", "zpid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def zillow
  rillow = Rillow.new('X1-ZWz1fgbe5szxmz_29gz1')
  result = rillow.get_search_results(params[:address], params[:citystatezip])
  result.to_hash

  zpid = result["response"][0]["results"][0]["result"][0]["zpid"][0]
  street = result["response"][0]["results"][0]["result"][0]["address"][0]["street"][0]
  city = result["response"][0]["results"][0]["result"][0]["address"][0]["city"][0]
  zip = result["response"][0]["results"][0]["result"][0]["address"][0]["zipcode"][0]
  state = result["response"][0]["results"][0]["result"][0]["address"][0]["state"][0]
  latitude = result["response"][0]["results"][0]["result"][0]["address"][0]["latitude"][0]
  longitude = result["response"][0]["results"][0]["result"][0]["address"][0]["longitude"][0]
  zestimate = result["response"][0]["results"][0]["result"][0]["zestimate"][0]["amount"][0]["content"]
  thirty_day_change = result["response"][0]["results"][0]["result"][0]["zestimate"][0]["valueChange"][0]["content"]

  principle_property = Property.create(zpid:zpid, street:street, city:city, zip:zip, state:state, latitude:latitude, longitude:longitude, zestimate:zestimate, thirty_day_change:thirty_day_change)

INSERT INTO "comps" ("street", "city", "state", "zip", "latitude", "longitude", "zestimate", "thirty_day_change", "percentile", "year_tax_assessed", "tax_assessment", "year_built", "square_feet", "bathrooms", "bedrooms", "last_sold_date", "last_sold_price", "zpid", "home_details_link", "chart_data_link", "map_this_home_link", "similar_sales_link", "property_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"
---
    map_this_home_link = property["links"][0]["mapthishome"][0]
    similar_sales_link = property["links"][0]["comparables"][0]

    principle_property.comps.create(zpid:zpid, street:street, city:city, zip:zip, state:state, latitude:latitude, longitude:longitude, zestimate:zestimate, thirty_day_change:thirty_day_change, percentile:percentile, year_tax_assessed:year_tax_assessed, tax_assessment:tax_assessment, year_built:year_built, square_feet:square_feet, bathrooms:bathrooms, bedrooms:bedrooms, last_sold_date:last_sold_date, last_sold_price:last_sold_price, home_details_link:home_details_link, chart_data_link:chart_data_link, map_this_home_link:map_this_home_link, similar_sales_link:similar_sales_link)