app/controllers/properties_controller.rb

SELECT  "properties".* FROM "properties" ORDER BY "properties"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @property = Property.last